In [1]:
import pandas as pd
import numpy as np

# Pandas

This notebook will accompany the section 3 from the chapter - pandas: data analysis library. 

Pandas has two main concepts to structure the data: Series, for 1-dimensional labeled data, and DataFrames, for 2-dimensional labeled data. They have similar structure: index column, column(s) and rows (see figure below).

<img src="./Figures/PandasBasics.pdf">

A Series is the simplest concept so we will start by understanding how we can create one. The following line of code shows how to initialize a Series.

## Series

How can we initialize a Series? A Series can be initialized with a Python dictionary, an ndarray or a scalar value.

### Initialize a Series as an nd-array

In [2]:
pd.Series(np.random.randn(7), index=["N", "E", "U", "B", "I", "A", "S"])

N   -0.857368
E   -0.838982
U    0.176068
B    0.298170
I    1.343234
A   -0.402124
S   -0.893396
dtype: float64

### Initialize a Series as a Dictionary

In [3]:
pd.Series({"A":0, "B":1, "C":2}, dtype=float)

A    0.0
B    1.0
C    2.0
dtype: float64

### Initialize a Series as an integer

In [4]:
pd.Series(10, index=["a", "b", "c"], dtype=int)

a    10
b    10
c    10
dtype: int64

### Indexing and slicing a Series

Indexing a Series and performing some basic numeric operations can be very similar to a NumPy array. Actually, you can apply functions like ``np.mean()``to a Series. Just take into account that operations such as slicing will also slice the pandas series index.

In [5]:
s = pd.Series(np.random.randint(0,10,20))

In [6]:
print('Indexing one value:')
print(s[0],"\n")
print('Indexing several values:')
print(s[[2,3,4]],"\n")
print('Using Numpy operations:')
print(s[s<5],"\n")
print('Using Numpy operations, like calculating the mean:')
print(np.mean(s),"\n")

Indexing one value:
9

Indexing several values:
2    2
3    9
4    4
dtype: int64

Using Numpy operations:
1     0
2     2
4     4
5     2
6     3
7     3
10    4
11    4
12    0
13    3
14    1
15    3
19    0
dtype: int64

Using Numpy operations, like calculating the mean:
4.15

As you can see, the left column - the indexes - are slso sliced and therefore some are missing. If you want to restart the indexes so they start from 0, you can use ``reset_index``. Note that a new column with the name *index* is created where the sliced indexes are saved.

In [11]:
s[[2,3,4]].reset_index()

   index  0
0      2  2
1      3  9
2      4  4

### Missing values in a Series
By default, if one value is missing in a Series (or in a DataFrame as you will see later), a NaN value will be introduced in the empty position.

In [7]:
s[3:]+s[:-3]

0      NaN
1      NaN
2      NaN
3      0.0
4     18.0
5     14.0
6      4.0
7      4.0
8     16.0
9     12.0
10     4.0
11     6.0
12     0.0
13     6.0
14    12.0
15     0.0
16    16.0
17     NaN
18     NaN
19     NaN
dtype: float64

## DataFrames

The most commonly used pandas data structure is a DataFrame. A pandas DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. Similar to a Series, a DataFrame can be created using the following line of code. 

``pd.DataFrame(data, index, column, type)``


The data used to initialize a DataFrame can be: Python Dictionary of 1D ndarrays, lists, dicts or Series, it can also be a 2-D ndarray or another DataFrame. In the following lines of code we will see how to initialize a DataFrame using a python dictionary. We will then explore how to handle columns to re-arrange the data.

### Initialize a DataFrame using Series

In [16]:
# Series
s1 = pd.Series({"A":0, "B":1, "C":2}, dtype=float)
s2 = pd.Series({"D":3, "E":4, "F":5}, dtype=float)
s3 = pd.Series({"G":6, "H":7, "I":8}, dtype=float)

# Dict of Series
d = {'Series 1':s1, 'Series 2':s2, 'Series 3':s3}

# DataFrame from the dictionary of Series
df = pd.DataFrame(d)
df

   Series 1  Series 2  Series 3
A       0.0       NaN       NaN
B       1.0       NaN       NaN
C       2.0       NaN       NaN
D       NaN       3.0       NaN
E       NaN       4.0       NaN
F       NaN       5.0       NaN
G       NaN       NaN       6.0
H       NaN       NaN       7.0
I       NaN       NaN       8.0

You can also choose which indexes (rows) from the Series you want to use to create the new DataFrame.

In [17]:
# Choose which rows you want to add in the DataFrame
pd.DataFrame(d, index=['A', 'B', 'E'])

   Series 1  Series 2  Series 3
A       0.0       NaN       NaN
B       1.0       NaN       NaN
E       NaN       4.0       NaN

 Moreover, you can say which Series from the dict you want to add as columns.

In [18]:
# Choose which rows and columns you want to add in the DataFrame
pd.DataFrame(d, index=['C', 'A', 'G'], columns=['Series 1', 'Series 3'])

   Series 1  Series 3
C       2.0       NaN
A       0.0       NaN
G       NaN       6.0

As you can see, in the DataFrames, missing values are also saved as ``NaN``.

### Indexing a DataFrame
#### Why use the object property *loc*?

DataFrames are indexed by columns, ``df['column_name']``, but you can also select both rows and columns by using: ``df.loc['row_index', 'column_name']``. The following examples show how to index a DataFrame.

In [25]:
df = pd.DataFrame({'A':[1,2,3,4,5], 'B':[6,7,8,9,10], 'C':[11,12,13,14,15]})
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [26]:
# Slicing without loc
df[1:3]

   A  B   C
1  2  7  12
2  3  8  13

In [27]:
# Slicing with loc
df.loc[1:3]

   A  B   C
1  2  7  12
2  3  8  13
3  4  9  14

Note that we are getting two different results when we index with and without ``.loc`` .

In the next line, we use the ``.loc`` function to access a value given a column (`'A'`) and a row (`1`).

In [29]:
# Indexing a value which is in row 1 and column A
df.loc[1,'A']

2

# Handling a DataFrame

### Selection, addition and deletion of columns
#### Example 1

In [30]:
df = pd.DataFrame({"A":["a", "b","c"], "B":[1,2,3]})
df

   A  B
0  a  1
1  b  2
2  c  3

In [31]:
# Add a column
df["C"] = ["D","F","G"]
df

   A  B  C
0  a  1  D
1  b  2  F
2  c  3  G

In [32]:
# Delete a column
del df["A"] 
df

   B  C
0  1  D
1  2  F
2  3  G

#### Example 2

In [33]:
df = pd.DataFrame({"A":["a", "b","c"], "B":[1,2,3], "C":["A","B","C"]})
df

   A  B  C
0  a  1  A
1  b  2  B
2  c  3  C

In [34]:
# Add a column
df["D"] = ["1","2","3"]
df

   A  B  C  D
0  a  1  A  1
1  b  2  B  2
2  c  3  C  3

In [35]:
# Add a column in a specific location
df.insert(1, 'E', ['one', 'two','three'])
df

   A      E  B  C  D
0  a    one  1  A  1
1  b    two  2  B  2
2  c  three  3  C  3

# Basic operations

### Matching and Broadcasting

For this example, we will create two DataFrames - ``df1`` and ``df2``- from two dictionaries ``d1``and ``d2``.

In [36]:
# Dictionary 
d1 = {"abc": ["a", "b", "c", "a", "b", "c"], \
      "123": [1, 2, 3, 4, 5, 6], \
      "ABC":["A", "A", "B", "B", "C", "C"], \
      "num": ["one", "two", "three", "four", "five", "six"]}

d2 = {"abc": ["d", "d", "e", "c", "b", "e"], \
      "123": [7, 8, 9, 10, 11, 12], \
      "ABC":["D", "D", "E", "A", "B", "A"], \
      "num": ["seven", "eight", "nine", "four", "five", "six"]}

# DataFrame from a Dictionary
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

We are going to add a column from each DataFrame using ``.add`` or, equivalently by using the ``+``sign

In [37]:
df1["123"].add(df2["123"])

0     8
1    10
2    12
3    14
4    16
5    18
Name: 123, dtype: int64

In [39]:
df1["123"] + df2["123"]

0     8
1    10
2    12
3    14
4    16
5    18
Name: 123, dtype: int64

In a similar manner we can subtract, multiply and divide chosen columns from more than one DataFrame.

In [40]:
df1['123'].sub(df2['123'])

0   -6
1   -6
2   -6
3   -6
4   -6
5   -6
Name: 123, dtype: int64

In [41]:
df1['123'].mul(df2['123'])

0     7
1    16
2    27
3    40
4    55
5    72
Name: 123, dtype: int64

In [42]:
df1['123'].div(df2['123'])

0    0.142857
1    0.250000
2    0.333333
3    0.400000
4    0.454545
5    0.500000
Name: 123, dtype: float64

There are also several other basic operations like for example to calculate the mean by using ``df.mean()``. In the book we explain several other examples of these basic operations.

In [44]:
df.mean()

B     2.0
D    41.0
dtype: float64

# Import data using pandas

As mentioned in the book chapter, we will only focus on importing data from ``csv`` (comma separated values) files. In the following lines we will see how we can import the data into a DataFrame. The files we will use are shown in the examples of tables 4.

In [45]:
# Simple import of a file in the Data folder called PulseVsConcentration.csv
df1 = pd.read_csv('./Data/PulseVsConcentration.csv')
df1

  Concentration  5 min  10 min  20 min  30 min
0        500 um    2.3     9.2    12.5    16.9
1        100 um    5.4     9.9    13.3    17.0
2         20 um    3.2     9.8    13.5    17.4
3         10 um    4.8     9.2    14.2    17.7

In [46]:
# In this case, the file has multi-index: there are two rows as headers
df2 = pd.read_csv('./Data/DMSOVsDrug.csv', header=[0,1])
df2

  DMSO       Drug
  0.1% 0.5% 10 um 50 um
0   20  100    32    78
1   28  102    47    98
2   34  103    53    96

As you can see, headers are shown in bolt font, on the right we have the index values (numbers starting from 0).

# Tidy data sets

Using Wickham's definitions, in terms of the physical layout of a data set, to accomplish a tidy data set we need to fulfill the following structure:


- A data-set is a collection of values which can be either strings or numbers.
- Variables are measures of certain attributes like time, distance and speed, across units. The variables will form the columns.
- Observations are all the values measured with the same units across all attributes. The observations will form the rows. 


A messy data-set would be any other arrangement of the data. We will start with two simple examples (the 2 csv files we previously imported) which are in the messy format: ``df1`` and ``df2`` . 
To transform a DataFrame from messy format (like in table 4) into a tidy format (like in table 5), we will use ``pd.melt()``.  This function allows you to gather columns into rows to unpivot a DataFrame from wide format to long format. The inverse operation will be to pivot the data, this can be done with ``pd.pivot()``.

The figure below shows an exmaple on how these operations work. 
<img src="./Figures/ReshapePandas1.pdf">

In [30]:
df1

  Concentration  5 min  10 min  20 min  30 min
0        500 um    2.3     9.2    12.5    16.9
1        100 um    5.4     9.9    13.3    17.0
2         20 um    3.2     9.8    13.5    17.4
3         10 um    4.8     9.2    14.2    17.7

The DataFrame ``df1`` is structured as a messy data-set. To transform it into a tidy data-set, we will use ``pd.melt()`` :

In [31]:
# Convert into tidy form
pd.melt(df1, id_vars='Concentration', var_name='Pulse Duration', value_name='Result')

   Concentration Pulse Duration  Result
0         500 um          5 min     2.3
1         100 um          5 min     5.4
2          20 um          5 min     3.2
3          10 um          5 min     4.8
4         500 um         10 min     9.2
5         100 um         10 min     9.9
6          20 um         10 min     9.8
7          10 um         10 min     9.2
8         500 um         20 min    12.5
9         100 um         20 min    13.3
10         20 um         20 min    13.5
11         10 um         20 min    14.2
12        500 um         30 min    16.9
13        100 um         30 min    17.0
14         20 um         30 min    17.4
15         10 um         30 min    17.7

We do the same thing with the other DataFrame ``df2``. Note that we do not use the exact same input parameters for both since ``df1`` had only one row of headers whereas ``df2``has 2 rows. This will slightly change the way we melt these two DataFrames so that the output has the same tidy structure.

In [48]:
df2.head()

  DMSO       Drug
  0.1% 0.5% 10 um 50 um
0   20  100    32    78
1   28  102    47    98
2   34  103    53    96

In [49]:
pd.melt(df2, var_name=['Treatment', 'Concentration'], value_name='Result')

   Treatment Concentration  Result
0       DMSO          0.1%      20
1       DMSO          0.1%      28
2       DMSO          0.1%      34
3       DMSO          0.5%     100
4       DMSO          0.5%     102
5       DMSO          0.5%     103
6       Drug         10 um      32
7       Drug         10 um      47
8       Drug         10 um      53
9       Drug         50 um      78
10      Drug         50 um      98
11      Drug         50 um      96

# Split-Apply-Combine

Split-Apply-Combine strategy, first formalized by Hadley Wickham as "*break up a big problem into manageable pieces, operate on each piece independently and then put all the pieces back together"*.

This strategy only makes sense if your data is in a tidy format because the data will be split-up according to the selected columns. You can then apply functions to the this new grouped data and combine the results into a new data set.  

In the following examples we will see how we can split a DataFrame using the ``df.grouby()`` method, apply some operations using aggregation, filtration and transformation, and finally, how we can combine the datasets into new DataFrames. 

For a better understanding on how the split-apply-combine strategy works, have a look at the following figure:
<img src="./Figures/SplitApplyCombine.pdf">

Before we start the split-apply-combine method, we first want to save out melted data into new DataFrames ``df1_melt`` and ``df2_melt``.

In [50]:
# Melted data : tidy format
df1_melt = pd.melt(df1, id_vars='Concentration', var_name='Pulse Duration', value_name='Result')
df2_melt = pd.melt(df2, var_name=['Treatment', 'Concentration'], value_name='Result')

## Split

The ``df.groupby()`` operation, performs the splitting part using any data axis. As a result, you get a ``DataFrameGroupBy`` object ordered according to the selected group.

In [51]:
type(df1_melt.groupby('Pulse Duration'))

pandas.core.groupby.generic.DataFrameGroupBy

In the following examples we will group ``df1_melt`` by *Pulse Duration* and ``df2_melt`` by *Treatment*. We will then save these groupby objects in new variables.

In [54]:
# Group df1 by the Pulse Duration category
df1_groupby = df1_melt.groupby('Pulse Duration')

# Group df2 by the Treatment category
df2_groupby = df2_melt.groupby('Treatment')

To know which are the resulting groups from our grouby method, we use ``df.groups.keys()`` to know which are the names of the keys for each of the groups.

In [53]:
# Show the groups from groupby method
print('df1 groups: ',df1_groupby.groups.keys())
print('df2 groups: ',df2_groupby.groups.keys())

df1 groups:  dict_keys(['10 min', '20 min', '30 min', '5 min'])
df2 groups:  dict_keys(['DMSO', 'Drug'])

As expected, ``df1_groupby`` was grouped according to pulse duration which is why the resulting groups are each of these durations : 10 min, 20 min, 30 min, 5 mins. The same way, ``df2_groupby`` was grouped according to treatment and therefore the resulting groups are DMSO and Drug.

### Iterating through groups

Here are some examples of how we can iterate through each of the groups that resulted from the groupby method.

In [57]:
for name, group in df1_groupby:
    print(name)
    print(group)

10 min
  Concentration Pulse Duration  Result
4        500 um         10 min     9.2
5        100 um         10 min     9.9
6         20 um         10 min     9.8
7         10 um         10 min     9.2
20 min
   Concentration Pulse Duration  Result
8         500 um         20 min    12.5
9         100 um         20 min    13.3
10         20 um         20 min    13.5
11         10 um         20 min    14.2
30 min
   Concentration Pulse Duration  Result
12        500 um         30 min    16.9
13        100 um         30 min    17.0
14         20 um         30 min    17.4
15         10 um         30 min    17.7
5 min
  Concentration Pulse Duration  Result
0        500 um          5 min     2.3
1        100 um          5 min     5.4
2         20 um          5 min     3.2
3         10 um          5 min     4.8

In [58]:
for name, group in df2_groupby:
    print(name)
    print(group)

DMSO
  Treatment Concentration  Result
0      DMSO          0.1%      20
1      DMSO          0.1%      28
2      DMSO          0.1%      34
3      DMSO          0.5%     100
4      DMSO          0.5%     102
5      DMSO          0.5%     103
Drug
   Treatment Concentration  Result
6       Drug         10 um      32
7       Drug         10 um      47
8       Drug         10 um      53
9       Drug         50 um      78
10      Drug         50 um      98
11      Drug         50 um      96

### Select one group from the grouby object

Sometimes you group the data but you just need one speicic group to work with. For this, we can use the ``.get_group()``.

In [59]:
df1_groupby.get_group('10 min')

  Concentration Pulse Duration  Result
4        500 um         10 min     9.2
5        100 um         10 min     9.9
6         20 um         10 min     9.8
7         10 um         10 min     9.2

## Apply

Once the data has been grouped and split-up, we can apply functions to these new DataFrames. For this, there are the following operations: Aggregations, Transformations and Filtrations.

### Aggregations

Aggregations allow to compute one or more summary statistics to the ``groupby`` object, like in the following example, the mean to each of the groups.

In [60]:
df1_groupby.aggregate(np.mean)

                Result
Pulse Duration
10 min           9.525
20 min          13.375
30 min          17.250
5 min            3.925

In the above result the aggregated column is now the index column, to avoid this you can use the reset_index() method. This will put back the numerical index and the aggregated column will become a column again.

In [61]:
df1_groupby.aggregate(np.mean).reset_index()

  Pulse Duration  Result
0         10 min   9.525
1         20 min  13.375
2         30 min  17.250
3          5 min   3.925

You would get the same results as if you perform the following:

In [45]:
df1_groupby.mean().reset_index()

  Pulse Duration  Result
0         10 min   9.525
1         20 min  13.375
2         30 min  17.250
3          5 min   3.925

You can also perform statistics in only one of the groups from the groupby object that you previously selected using the get_group function.

In [46]:
df1_groupby.get_group('10 min').aggregate(np.mean)

Result    9.525
dtype: float64

You can also apply several functions at the same time:

In [47]:
df1_groupby.agg([np.mean, np.sum]).reset_index()

  Pulse Duration  Result
                    mean   sum
0         10 min   9.525  38.1
1         20 min  13.375  53.5
2         30 min  17.250  69.0
3          5 min   3.925  15.7

Moreoever, you can apply different functions to different columns.

In [63]:
df1_groupby.agg({'Result':np.mean, 'Pulse Duration':np.size})

                Result  Pulse Duration
Pulse Duration
10 min           9.525               4
20 min          13.375               4
30 min          17.250               4
5 min            3.925               4

#### Describe: general statistics

Sometimes before you perform any detailed analysis you just want to check some summary statistics on each of the rows and columns of your DataFrame. For this, the ``describe()`` method is very useful. For example, in the following line we show the summary statistics of the melted dataframe ``df1`` grouped by pulse duration.

In [62]:
df1_groupby.describe()

               Result
                count    mean       std   min     25%   50%     75%   max
Pulse Duration
10 min            4.0   9.525  0.377492   9.2   9.200   9.5   9.825   9.9
20 min            4.0  13.375  0.699405  12.5  13.100  13.4  13.675  14.2
30 min            4.0  17.250  0.369685  16.9  16.975  17.2  17.475  17.7
5 min             4.0   3.925  1.426826   2.3   2.975   4.0   4.950   5.4

### Transformations

Performs some computation to a specific group. This method returns an object which has the same size and index as the grouped object. In the following example we take the grouped object and we select one of the groups to apply two functions to the result values, in this case the square root and an exponential.

In [64]:
df1_groupby.get_group('10 min').transform([np.sqrt, np.exp])

     Result
       sqrt           exp
4  3.033150   9897.129059
5  3.146427  19930.370438
6  3.130495  18033.744928
7  3.033150   9897.129059

In [65]:
df2_groupby.get_group('DMSO').transform([np.sqrt,np.exp])

      Result
        sqrt           exp
0   4.472136  4.851652e+08
1   5.291503  1.446257e+12
2   5.830952  5.834617e+14
3  10.000000  2.688117e+43
4  10.099505  1.986265e+44
5  10.148892  5.399228e+44

Besides the builting functions, you can also define your own function, like the one below ``f_exp()`` and apply it to one ore more groups.

In [66]:
def f_exp(x):
    return np.exp(x)

df2_groupby.get_group('DMSO').transform([np.sqrt,f_exp])

      Result
        sqrt         f_exp
0   4.472136  4.851652e+08
1   5.291503  1.446257e+12
2   5.830952  5.834617e+14
3  10.000000  2.688117e+43
4  10.099505  1.986265e+44
5  10.148892  5.399228e+44

### Filtration

Discards some groups according to some group criteria. When you apply a function to a group as a filter argument, the output will be boolean (True or False).

One example when using filtering is to choose the columns from a groupby object. For example, in the following line we have the `groupby` object and from all the treatments we choose get the groups which were treated with DMSO.

In [208]:
df2_groupby.get_group('DMSO')

  Treatment Concentration  Result
0      DMSO          0.1%      20
1      DMSO          0.1%      28
2      DMSO          0.1%      34
3      DMSO          0.5%     100
4      DMSO          0.5%     102
5      DMSO          0.5%     103

A simple filter example is to only get the columns we are interested on, for example the Treatment and Result column.

In [207]:
df2_groupby.get_group('DMSO').filter(items=['Treatment', 'Result'])

  Treatment  Result
0      DMSO      20
1      DMSO      28
2      DMSO      34
3      DMSO     100
4      DMSO     102
5      DMSO     103

A more complicated example is to filter by only choosing values from a column which are higher than the overall mean value. For this, we can use a ``lambda``function which will allow us to compare each row from the chosen column (from each from of the ``groupby``object) and compare it to the calculated overall mean. This way we will remain only with the values from the rows which are higher than the mean.

In [174]:
df2_groupby.filter(lambda x: np.mean(x['Result'])>np.mean(df2_melt['Result']))

   Treatment Concentration  Result
6       Drug         10 um      32
7       Drug         10 um      47
8       Drug         10 um      53
9       Drug         50 um      78
10      Drug         50 um      98
11      Drug         50 um      96

Because we grouped by Treatments, what we get are the two groups which means is higher than the overall mean (the drug treatment, $10 \mu M$ and $50 \mu M$). 

The next line of code shows the same as above but this time we grouped by concentration instead of by treatment. This means that we are now comparing the mean from each concentration group to the overall mean.

In [223]:
df2_melt.groupby('Concentration').filter(lambda x: np.mean(x['Result'])>np.mean(df2_melt['Result']))

   Treatment Concentration  Result
3       DMSO          0.5%     100
4       DMSO          0.5%     102
5       DMSO          0.5%     103
9       Drug         50 um      78
10      Drug         50 um      98
11      Drug         50 um      96

As a result, we obtain that the $0.5\%$ DMSO group and the $50 \mu M$ Drug group are the ones with values higher than the overall mean.

We are now going to test the function `df.query()`, which allows us to query the columns we choose from a DataFrame with a boolean expression.

In this case we take the groupby object we previusly defined, `df2_groupby`, we get the specific group we want to analyse, in this case the DMSO treatment and as before, we apply 
the square root and an exponential function to all the values.

In [153]:
df3 = df2_groupby.get_group('DMSO').transform([np.sqrt,f_exp])['Result']
df3

        sqrt         f_exp
0   4.472136  4.851652e+08
1   5.291503  1.446257e+12
2   5.830952  5.834617e+14
3  10.000000  2.688117e+43
4  10.099505  1.986265e+44
5  10.148892  5.399228e+44

Moreover, we now want to rename the columns and divide the exponential column by a factor of $10^{20}$.

In [160]:
df3_renamed = df3.rename(index=str, columns={'sqrt':'SquareRoot', 'f_exp':'Exponential'})
df3_renamed['Exponential'] = df3_renamed['Exponential']/(10**20)
df3_renamed

   SquareRoot  Exponential
0    4.472136  4.85165e-12
1    5.291503  1.44626e-08
2    5.830952  5.83462e-06
3   10.000000  2.68812e+23
4   10.099505  1.98626e+24
5   10.148892  5.39923e+24

This example is just to exemplify how `df.query()`works. We just redefined a new DataFrame and now we want to compare whether one of these columns is bigger than the other. For example, in which cases is the Square root smaller than the exponential column.

In [159]:
df3_renamed.query('SquareRoot < Exponential')

   SquareRoot  Exponential
3   10.000000  2.68812e+23
4   10.099505  1.98626e+24
5   10.148892  5.39923e+24

With the `df.query()`is easy to query the columns with a boolean expression. This can also be done without this function with the following lines:

In [162]:
df3_renamed[df3_renamed.SquareRoot > df3_renamed.Exponential]

   SquareRoot  Exponential
0    4.472136  4.85165e-12
1    5.291503  1.44626e-08
2    5.830952  5.83462e-06

## Combine

In this case, we will combine the results from two transformation methods into one new DataFrame by using the ``pd.concat()`` function. Depending on the axis, you can combine the two DataFrames horizontally or vertically.

In [230]:
# We split the data according to the treatment and we apply a transformation (a square root
# and an exponential) to a specific group: Drug and DMSO, separately
df2_result1 = df2_groupby.get_group('DMSO').transform([np.sqrt,f_exp])
df2_result2 = df2_groupby.get_group('Drug').transform([np.sqrt,f_exp])

In [231]:
# We then combine the results using concatenation
df2_concat = pd.concat([df2_result1, df2_result2], axis=0)
df2_concat

       Result
         sqrt         f_exp
0    4.472136  4.851652e+08
1    5.291503  1.446257e+12
2    5.830952  5.834617e+14
3   10.000000  2.688117e+43
4   10.099505  1.986265e+44
5   10.148892  5.399228e+44
6    5.656854  7.896296e+13
7    6.855655  2.581313e+20
8    7.280110  1.041376e+23
9    8.831761  7.498417e+33
10   9.899495  3.637971e+42
11   9.797959  4.923458e+41

In [232]:
# We then combine the results using concatenation (in the other dimension)
# We rename the columns in order to differentiate the 2 treatments
df2_concat = pd.concat([df2_result1.rename(index=str, columns={"Result": "DMSO"}) \
                        ,df2_result2.rename(index=str, columns={"Result": "Drug"})], axis=1, sort=False)
df2_concat

         DMSO                    Drug
         sqrt         f_exp      sqrt         f_exp
0    4.472136  4.851652e+08       NaN           NaN
1    5.291503  1.446257e+12       NaN           NaN
2    5.830952  5.834617e+14       NaN           NaN
3   10.000000  2.688117e+43       NaN           NaN
4   10.099505  1.986265e+44       NaN           NaN
5   10.148892  5.399228e+44       NaN           NaN
6         NaN           NaN  5.656854  7.896296e+13
7         NaN           NaN  6.855655  2.581313e+20
8         NaN           NaN  7.280110  1.041376e+23
9         NaN           NaN  8.831761  7.498417e+33
10        NaN           NaN  9.899495  3.637971e+42
11        NaN           NaN  9.797959  4.923458e+41

As you can see, they were horizontally concatenated but according to their index. So, in order to reset the index we will use the ``df.reset_index(drop=True)`` to make the index start from 0 in both DataFrames and the ``drop=True`` is to avoid the formation of the new column with the index values.

In [59]:
# We then combine the results using concatenation (in the other dimension)
# We rename the columns in order to differentiate the 2 treatments
df2_concat = pd.concat([df2_result1.rename(index=str, columns={"Result": "DMSO"}) \
                        ,df2_result2.reset_index(drop=True).rename(index=str, columns={"Result": "Drug"})], axis=1)
df2_concat

        DMSO                    Drug
        sqrt         f_exp      sqrt         f_exp
0   4.472136  4.851652e+08  5.656854  7.896296e+13
1   5.291503  1.446257e+12  6.855655  2.581313e+20
2   5.830952  5.834617e+14  7.280110  1.041376e+23
3  10.000000  2.688117e+43  8.831761  7.498417e+33
4  10.099505  1.986265e+44  9.899495  3.637971e+42
5  10.148892  5.399228e+44  9.797959  4.923458e+41